In [1]:
import pandas as pd

In [2]:
S = pd.Series([3, -5, 7, 4], index=['a', 'b', 'c', 'd'])
S

a    3
b   -5
c    7
d    4
dtype: int64

In [4]:
data = [['Tagore', 100], ['Ray', 70], ['Dutta', 50]]
Df = pd.DataFrame(data, columns=['Name', 'Price'])
Df

     Name  Price
0  Tagore    100
1     Ray     70
2   Dutta     50

In [15]:
data = pd.read_csv('data.csv')
data

     Name  Price
0  Tagore    100
1     Ray     70
2   Dutta     50

In [9]:
data.to_csv('abcd.csv')

In [11]:
df = pd.read_csv('abcd.csv', header=None)
df

     0       1      2
0  NaN       0      1
1  0.0    Name  Price
2  1.0  Tagore    100
3  2.0     Ray     70
4  3.0   Dutta     50

In [13]:
df1 = data.sort_index()
df1

        0      1
0    Name  Price
1  Tagore    100
2     Ray     70
3   Dutta     50

In [16]:
df2 = data.sort_values(by='Name')
df2

     Name  Price
2   Dutta     50
1     Ray     70
0  Tagore    100

In [17]:
df3 = data.sort_values(by='Price')
df3

     Name  Price
2   Dutta     50
1     Ray     70
0  Tagore    100